experiments/results/logs/ramp-hybrid-001/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 3720.993ms, rate sampling interval: 15212ms
  Thread calibration: mean lat.: 3714.930ms, rate sampling interval: 15130ms
  Thread calibration: mean lat.: 3724.685ms, rate sampling interval: 15269ms
  Thread calibration: mean lat.: 3693.416ms, rate sampling interval: 15048ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.60s    10.04s   33.51s    78.88%
    Req/Sec    24.43     23.78    75.00     78.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.25ms
 75.000%   14.93s 
 90.000%   24.64s 
 99.000%   31.39s 
 99.900%   33.33s 
 99.990%   33.49s 
 99.999%   33.52s 
100.000%   33.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.475     0.000000            1         1.00
       1.468     0.100000         2898         1.11
       1.786     0.200000         5786         1.25
       2.063     0.300000         8673         1.43
       2.393     0.400000        11569         1.67
      17.247     0.500000        14450         2.00
    2183.167     0.550000        15895         2.22
    5500.927     0.600000        17341         2.50
    9011.199     0.650000        18787         2.86
   12197.887     0.700000        20231         3.33
   14925.823     0.750000        21677         4.00
   16703.487     0.775000        22403         4.44
   18317.311     0.800000        23126         5.00
   19922.943     0.825000        23851         5.71
   21708.799     0.850000        24569         6.67
   23445.503     0.875000        25293         8.00
   23986.175     0.887500        25654         8.89
   24641.535     0.900000        26011        10.00
   25362.431     0.912500        26381        11.43
   25870.335     0.925000        26733        13.33
   26722.303     0.937500        27103        16.00
   27377.663     0.943750        27279        17.78
   27557.887     0.950000        27456        20.00
   28311.551     0.956250        27641        22.86
   28508.159     0.962500        27821        26.67
   29310.975     0.968750        28006        32.00
   29442.047     0.971875        28094        35.56
   29589.503     0.975000        28186        40.00
   30261.247     0.978125        28268        45.71
   30408.703     0.981250        28363        53.33
   30523.391     0.984375        28450        64.00
   30687.231     0.985938        28495        71.11
   31293.439     0.987500        28543        80.00
   31342.591     0.989062        28584        91.43
   31424.511     0.990625        28631       106.67
   31522.815     0.992188        28677       128.00
   31621.119     0.992969        28697       142.22
   32243.711     0.993750        28720       160.00
   32292.863     0.994531        28743       182.86
   32342.015     0.995313        28773       213.33
   32374.783     0.996094        28790       256.00
   32407.551     0.996484        28804       284.44
   32423.935     0.996875        28813       320.00
   32456.703     0.997266        28821       365.71
   32505.855     0.997656        28833       426.67
   32587.775     0.998047        28845       512.00
   32620.543     0.998242        28850       568.89
   33275.903     0.998437        28856       640.00
   33292.287     0.998633        28862       731.43
   33325.055     0.998828        28872       853.33
   33325.055     0.999023        28872      1024.00
   33341.439     0.999121        28879      1137.78
   33341.439     0.999219        28879      1280.00
   33357.823     0.999316        28885      1462.86
   33357.823     0.999414        28885      1706.67
   33374.207     0.999512        28887      2048.00
   33390.591     0.999561        28889      2275.56
   33390.591     0.999609        28889      2560.00
   33406.975     0.999658        28892      2925.71
   33406.975     0.999707        28892      3413.33
   33423.359     0.999756        28894      4096.00
   33423.359     0.999780        28894      4551.11
   33439.743     0.999805        28895      5120.00
   33472.511     0.999829        28896      5851.43
   33472.511     0.999854        28896      6826.67
   33488.895     0.999878        28897      8192.00
   33488.895     0.999890        28897      9102.22
   33505.279     0.999902        28899     10240.00
   33505.279     0.999915        28899     11702.86
   33505.279     0.999927        28899     13653.33
   33505.279     0.999939        28899     16384.00
   33505.279     0.999945        28899     18204.44
   33505.279     0.999951        28899     20480.00
   33505.279     0.999957        28899     23405.71
   33505.279     0.999963        28899     27306.67
   33521.663     0.999969        28900     32768.00
   33521.663     1.000000        28900          inf
#[Mean    =     7596.954, StdDeviation   =    10035.076]
#[Max     =    33505.280, Total count    =        28900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 5.00m, 157.85MB read
  Socket errors: connect 0, read 0, write 0, timeout 5821
  Non-2xx or 3xx responses: 29085
Requests/sec:    100.01
Transfer/sec:    538.79KB